Repository: muhammadxoja-sayfidinov/falarus-app
Catalog: lib/l10n/app_*.arb
Languages: tg, uz

# loginSubtitle
source: Prepare for your future.
tg: Ба ояндаи худ омода шавед.
uz: Kelajagingizga tayyorlaning.

source: Welcome Back
tg: Хуш омадед
uz: Xush kelibsiz

source: Phone Number
tg: Рақами телефон
uz: Telefon raqam

source: Get Started
tg: Оғоз кардан
uz: Boshlash

source: Courses
tg: Курсҳо
uz: Kurslar

source: Profile
tg: Профил
uz: Profil

source: Start Exam
tg: Оғози Имтиҳон
uz: Imtihonni Boshlash

source: Select Course
tg: Курсро интихоб кунед
uz: Kursni Tanlang

source: Tickets
tg: Билетҳо
uz: Biletlar

# ticket
source: Variant
tg: Вариант

source: Ticket Complete
tg: Билет ба охир расид
uz: Chipta Tugatildi

source: Correct Answers
tg: Ҷавобҳои дуруст
uz: To'g'ri Javoblar

source: Finish
tg: Тамом кардан
uz: Tugatish

source: Error loading ticket
tg: Хатогӣ дар боргирии билет
uz: Chiptani yuklashda xatolik

source: Previous
tg: Қаблӣ
uz: Oldingi

source: Next
tg: Баъдӣ
uz: Keyingi

source: Submit
tg: Супоридан
uz: Topshirish

# typeYourAnswer
source: Type your answer here...
tg: Ҷавоби худро дар ин ҷо нависед...
uz: Javobingizni shu yerga yozing...

source: Settings
tg: Танзимот
uz: Sozlamalar

source: Language
tg: Забон
uz: Til

source: Logout
tg: Баромадан
uz: Chiqish

source: Subscription
tg: Вазъият
uz: Holat

source: Free
tg: Стандарт
uz: Standart

source: Premium
tg: Дастрасии пурра
uz: To'liq kirish

source: Upgrade to Premium
tg: Гузариш ба Премиум
uz: Premiumga o'tish

source: You are Premium
tg: Дастрасии пурра фаъол
uz: To'liq kirish faol

source: Variant
tg: Вариант

source: Audio Question
tg: Саволи Аудиоӣ
uz: Audio Savol

# questionsOf
source: Question {n} of {m}
tg: Саволи {n} аз {m}
uz: {n}-savol, jami {m} ta

# loading
source: Loading resources...
tg: Боргирии захираҳо...
uz: Resurslar yuklanmoqda...

source: Passed
tg: Гузашт
uz: O'tdi

source: Failed
tg: Нагузашт
uz: O'tmadi

source: Locked
tg: Масдуд
uz: Yopiq

source: Open
tg: Кушода
uz: Ochiq

source: In Progress
tg: Дар раванд
uz: Jarayonda

# correctAnswer
source: Correct Answer: {answer}
tg: Ҷавоби дуруст: {answer}
uz: To'g'ri javob: {answer}

source: Correct!
tg: Дуруст!
uz: To'g'ri!

source: Mistakes
tg: Хато
uz: Xato

# currentScore
source: Correct
tg: Дуруст
uz: To'g'ri

# verificationTitle
source: Verification
tg: Тасдиқ
uz: Tasdiqlash

# verificationSubtitle
source: We sent a code to {phone}
tg: Мо ба рақами {phone} рамз фиристодем
uz: Biz {phone} raqamiga kod yubordik

source: Verify Code
tg: Тасдиқи рамз
uz: Kodni tasdiqlash

source: Variants
tg: Вариантҳо
uz: Variantlar

source: Questions
tg: Саволҳо
uz: Savollar

source: Coming Soon
tg: Ба зудӣ
uz: Tez orada

source: About You
tg: Дар бораи шумо
uz: Siz haqingizda

# enterDetailsSubtitle
source: Please enter your name
tg: Лутфан номи худро ворид кунед
uz: Iltimos, ismingizni kiriting

# firstNameInput
source: First Name
tg: Ном
uz: Ism

# lastNameInput
source: Last Name
tg: Насаб
uz: Familiya

# continueButton
source: Continue
tg: Идома додан
uz: Davom etish

# settingUpExam
source: Setting up your exam
tg: Танзими имтиҳон
uz: Imtihonni sozlash

# downloadingResources
source: We are downloading questions and images so your exam runs smoothly.
tg: Мо саволҳо ва тасвирҳоро боргирӣ карда истодаем, то имтиҳон бе мушкилӣ гузарад.
uz: Imtihon muammosiz ishlashi uchun savollar va rasmlarni yuklab olyapmiz.

source: Resolving assets...
tg: Коркарди захираҳо...
uz: Resurslar aniqlanmoqda...

source: Initializing...
tg: Омодасозӣ...
uz: Yuklanmoqda...

# courseContentStats
source: {variantCount} Variants | {questionCount} Questions
tg: {variantCount} Вариант | {questionCount} Савол
uz: {variantCount} Variant | {questionCount} Savol

# requiredField
source: Required
tg: Ҳатмӣ
uz: Majburiy

# tip1Title
source: Learn Anywhere
tg: Дар ҳама ҷо омӯзед
uz: Istalgan joyda o'rganing

# tip1Desc
source: Access your courses and exams from anywhere, anytime.
tg: Дастрасӣ ба курсҳо ва имтиҳонҳо дар ҳама вақт ва ҳама ҷо.
uz: Kurslar va imtihonlarga istalgan vaqtda va istalgan joydan kiring.

# tip2Title
source: Track Progress
tg: Натиҷаҳоро пайгирӣ кунед
uz: Natijalarni kuzating

# tip2Desc
source: Monitor your results and see how you improve over time.
tg: Натиҷаҳои худро назорат кунед ва пешрафти худро бубинед.
uz: Natijalaringizni tahlil qiling va o'sish ko'rsatkichlarini ko'ring.

# tip3Title
source: Pass Exams
tg: Имтиҳонҳоро супоред
uz: Imtihonlardan o'ting

# tip3Desc
source: Get ready for your exams with our comprehensive tests.
tg: Бо тестҳои ҳамаҷонибаи мо ба имтиҳонҳо омода шавед.
uz: Bizning keng qamrovli testlarimiz bilan imtihonlarga tayyorlaning.
